Tekla Open API Reference for Tekla Structures 2025
CurvedDimensionSetHandler.CreateCurvedDimensionSetRadial Method (ViewBase, Point, Point, Point, PointList, Double)
 Creates a curved dimension set from the specified points and inserts it to the database. Uses the default attributes.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public CurvedDimensionSetRadial CreateCurvedDimensionSetRadial(
	ViewBase View,
	Point ArcPoint1,
	Point ArcPoint2,
	Point ArcPoint3,
	PointList DimensionPoints,
	double Distance
)
Public Function CreateCurvedDimensionSetRadial (
	View As ViewBase,
	ArcPoint1 As Point,
	ArcPoint2 As Point,
	ArcPoint3 As Point,
	DimensionPoints As PointList,
	Distance As Double
) As CurvedDimensionSetRadial
Parameters
View
Type: Tekla.Structures.Drawing.ViewBase
The view to be used.
ArcPoint1
Type: Tekla.Structures.Geometry3d.Point
The first arc point to be used.
ArcPoint2
Type: Tekla.Structures.Geometry3d.Point
The second arc point to be used.
ArcPoint3
Type: Tekla.Structures.Geometry3d.Point
The third arc point to be used.
DimensionPoints
Type: Tekla.Structures.Drawing.PointList
The dimension points to be used.
Distance
Type: System.Double
The distance to be used.
Return Value
Type: CurvedDimensionSetRadial
The created dimension set or null if failed.
See Also
Reference
CurvedDimensionSetHandler Class
CreateCurvedDimensionSetRadial Overload
Tekla.Structures.Drawing Namespace